In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('salaries1.csv')

In [3]:
df

   orgainsation                  job     degree  salary_more_then_100k
0       google       sales executive  bachelors                      0
1       google       sales executive    masters                      0
2       google      business manager  bachelors                      1
3       google      business manager    masters                      1
4       google   computer programmer  bachelors                      0
5       google   computer programmer    masters                      1
6    abc pharma      sales executive    masters                      0
7    abc pharma  computer programmer  bachelors                      0
8    abc pharma     business manager  bachelors                      0
9    abc pharma     business manager    masters                      1
10     facebook      sales executive  bachelors                      1
11     facebook      sales executive    masters                      1
12     facebook     business manager  bachelors                      1
13     facebook     business manager    masters                      1
14     facebook  computer programmer  bachelors                      1
15     facebook  computer programmer    masters                      1

In [4]:
inputs=df.drop('salary_more_then_100k',axis='columns')

In [5]:
targets=df['salary_more_then_100k']

In [6]:
targets

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [7]:
from sklearn.preprocessing import LabelEncoder
le= LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [8]:
#inputs.company_n = le_company.fit_transform(inputs.company)
inputs['job_n'] = le_job.fit_transform(inputs['job'])
inputs['degree_n'] = le_degree.fit_transform(inputs['degree'])
#inputs['company_n'] = le_organisation.fit_transform(inputs['organisation'])

In [9]:
inputs.orgainsation=le.fit_transform(inputs.orgainsation)

In [10]:
inputs

    orgainsation                  job     degree  job_n  degree_n
0              2      sales executive  bachelors      2         0
1              2      sales executive    masters      2         1
2              2     business manager  bachelors      0         0
3              2     business manager    masters      0         1
4              2  computer programmer  bachelors      1         0
5              2  computer programmer    masters      1         1
6              0      sales executive    masters      2         1
7              0  computer programmer  bachelors      1         0
8              0     business manager  bachelors      0         0
9              0     business manager    masters      0         1
10             1      sales executive  bachelors      2         0
11             1      sales executive    masters      2         1
12             1     business manager  bachelors      0         0
13             1     business manager    masters      0         1
14             1  computer programmer  bachelors      1         0
15             1  computer programmer    masters      1         1

In [12]:
inputs_n=inputs.drop(['job','degree'],axis='columns')

In [14]:
inputs_n

    orgainsation  job_n  degree_n
0              2      2         0
1              2      2         1
2              2      0         0
3              2      0         1
4              2      1         0
5              2      1         1
6              0      2         1
7              0      1         0
8              0      0         0
9              0      0         1
10             1      2         0
11             1      2         1
12             1      0         0
13             1      0         1
14             1      1         0
15             1      1         1

In [15]:
targets

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [16]:
from sklearn import tree

In [17]:
model=tree.DecisionTreeClassifier()

In [19]:

model.fit(inputs_n,targets)

DecisionTreeClassifier()

In [20]:
model.score(inputs_n,targets)

1.0

In [22]:
model.predict([[2,2,0]])

array([0], dtype=int64)

In [24]:
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test= train_test_split(inputs_n,targets,test_size=0.2)

In [ ]:
model.fit()